In [8]:
import pandas as pd
data = [[110, 105, 99], [105, 88, 115], [109, 120, 130]]
index = [1, 2, 3]
columns = ['语文', '数学', '英语']
df = pd.DataFrame(data = data, index = index, columns = columns)
df

    语文   数学   英语
1  110  105   99
2  105   88  115
3  109  120  130

In [9]:
df['总成绩'] = df.sum(axis = 1)
df

    语文   数学   英语  总成绩
1  110  105   99  314
2  105   88  115  308
3  109  120  130  359

In [12]:
data = [[110, 105, 99], [105, 88, 115], [109, 120, 130], [112, 115]]
index = [1, 2, 3, 4]
df = pd.DataFrame(data = data, index = index, columns = columns)
new = df.mean()
df = df.append(new, ignore_index = True)
df

      语文     数学          英语
0  110.0  105.0   99.000000
1  105.0   88.0  115.000000
2  109.0  120.0  130.000000
3  112.0  115.0         NaN
4  109.0  107.0  114.666667

In [14]:
new = df.max()
new

语文    112.0
数学    120.0
英语    130.0
dtype: float64

In [15]:
df = df.append(new, ignore_index = True)
df

      语文     数学          英语
0  110.0  105.0   99.000000
1  105.0   88.0  115.000000
2  109.0  120.0  130.000000
3  112.0  115.0         NaN
4  109.0  107.0  114.666667
5  112.0  120.0  130.000000

In [16]:
df.median()

语文    109.5
数学    111.0
英语    115.0
dtype: float64

In [17]:
df.mode()

      语文     数学     英语
0  109.0  120.0  130.0
1  112.0    NaN    NaN

In [18]:
df['数学'].mode()

0    120.0
dtype: float64

In [19]:
df.mode(axis = 1)

       0      1           2
0   99.0  105.0  110.000000
1   88.0  105.0  115.000000
2  109.0  120.0  130.000000
3  112.0  115.0         NaN
4  107.0  109.0  114.666667
5  112.0  120.0  130.000000

In [20]:
df.var()

语文      6.700000
数学    147.766667
英语    167.188889
dtype: float64

In [21]:
df.var(axis = 1)

0     30.333333
1    186.333333
2    110.333333
3      4.500000
4     15.814815
5     81.333333
dtype: float64

In [22]:
df.std()

语文     2.588436
数学    12.155931
英语    12.930154
dtype: float64

In [24]:
data = [120, 89, 98, 78, 65, 102, 112, 56, 79, 45]
columns = ['数学']
df = pd.DataFrame(data = data, columns = columns)
x = df['数学'].quantile(0.35)
df[df['数学'] <= x]

   数学
3  78
4  65
7  56
9  45

In [ ]:
# 4.2 数据格式化